Day2

第二章 词法结构

JavaScript程序使用Unicode字符集编写的
JavaScript区分大小写，但HTML不区分大小写，尽管XHTML区分大小写，但是由于浏览器的纠错能力，即使有不严格的地方也会“宽容”地正确渲染

JavaScript标识符开头可以是字母、下划线、$，不能以数字开头，后续可以是字母、数字、下划线、$
JavaScript允许标识符中出现Unicode字符全集中的字母和数字，比如π，café
JavaScript也不能使用保留字来作为标识符

可选的分号
如果当前语句和下一行语句无法合并解析的时候，JavaScript则在第一行后填补分号，这是通用规则，但有两个例外：
1. 涉及return break continue时，如果这三个关键字后面紧跟了换行，那么会在换行处加分号
2. 涉及运算符 ++ -- 时,因为这俩能作为前缀也能作为后缀，做后缀时要跟表达式在同一行，不然会被当做前缀
例子：
return                 return;
true     会解析为       true;       会出错

x                      x;
++       会解析为       ++y
y



第三章 类型、值和变量

只有null、undefined是无法拥有方法的值。

全局变量：不在任何函数内部声明的变量，在JavaScript程序中任何地方都是可见的。特殊情况：在函数内没有用var声明是全局变量
局部变量：变量在函数内声明，只能在函数内部访问。

数据类型：能够操作并表示的值的类型
构造函数：如果函数用来初始化（使用new运算符）一个新建的对象，我们称之为构造函数。
类：每个构造函数定义了一类(class)对象————由构造函数初始化的对象组成的集合。类可以看做对象类型的子类型。JavaScript语言核心定义了三种类：日期类、正则类、错误类。

JavaScript的数据类型：
原始数据类型：数字、字符串、布尔值、null、undefined、Symbol
对象类型：狭义的对象(键值对)、数组、函数

JavaScript的类型可分为：
1. 原始类型和对象类型
2. 可以拥有方法的类型和不能拥有方法的类型
3. 可变类型和不可变类型：可变（对象、数组），不可变（数字、布尔值、null、undefined）
